var book = [
  {
    "name": "马列主义",
    "sub" : [
      {
        "name": "马克思、恩格斯著作",
      },
      {
        "name": "列宁著作",
      },
      {
        "name": "斯大林著作",
      },
      {
        "name": "毛泽东著作",
      },   
      {
        "name": "邓小平著作",
      }, 
      {
        "name": "著作汇编",
      }, 
      {
        "name": "生平和传记",
      }, 
      {
        "name": "学习和研究",
      }
    ]
  },
  {
    "name": "哲学、宗教",
    "sub": [
      {
        "name": "哲学理论",
      },
      {
        "name": "世界哲学",
      },
      {
        "name": "中国哲学",
      },
      {
        "name": "亚洲哲学",
      },
      {
        "name": "非洲哲学",
      },
      {
        "name": "欧洲哲学",
      },
      {
        "name": "大洋洲哲学",
      },
      {
        "name": "美洲哲学",
      },
      {
        "name": "人生观、人生哲学",
      },
      {
        "name": "无神论、宗教",
      }
    ]
  },
  {
    "name": "社会科学总论",
    "sub" : [
      {
        "name": "社会科学理论与方法论",
      },
      {
        "name": "社会科学现状、概况",
      },
      {
        "name": "机关、团体、会议",
      },
      {
        "name": "社会科学研究方法",
      },
      {
        "name": "社会科学教育与普及",
      },
      {
        "name": "社会科学丛书、文集、连续性出版物",
      },
      {
        "name": "社会科学参考工具书",
      },
      {
        "name": "社会科学文献检索工具书",
      },
      {
        "name": "统计学",
      }
    ]
  },
  {
    "name": "政治法律",
    "sub": [
      {
        "name": "政治理论",
      },
      {
        "name": "国际共产主义运动",
      },
      {
        "name": "中国共产党",
      },
      {
        "name": "世界政治",
      },
      {
        "name": "中国政治",
      },
      {
        "name": "外交、国际关系",
      },
      {
        "name": "法律",
      }
    ]
  },
  {
    "name": "军事",
    "sub" : [
      {
        "name": "军事理论",
      },
      {
        "name": "世界军事",
      },
      {
        "name": "中国军事",
      },
      {
        "name": "亚洲军事",
      },
      {
        "name": "非洲军事",
      },
      {
        "name": "欧洲军事",
      },
      {
        "name": "大洋洲军事",
      },
      {
        "name": "美洲军事",
      },
      {
        "name": "战略、战役、战术",
      }
    ]
  },
  {
    "name": "经济",
    "sub" : [
      {
        "name": "政治经济学",
      },
      {
        "name": "世界各国经济概况、经济史、经济地理",
      },
      {
        "name": "经济计划与管理",
      },
      {
        "name": "农业经济",
      },
      {
        "name": "贸易经济",
      },
      {
        "name": "财政、金融",
      }
    ]
  },
  {
    "name": "文化、科学、教育、体育",
    "sub" : [
      {
        "name": "文化理论",
      },
      {
        "name": "世界各国文化事业概况",
      },
      {
        "name": "信息与知识传播",
      },
      {
        "name": "科学、科学研究",
      },
      {
        "name": "教育",
      },
      {
        "name": "世界各国教育事业",
      },
      {
        "name": " 体育",
      }
    ]
  },
  {
    "name": "语言、文字",
    "sub" : [
      {
        "name": "语言学",
      },
      {
        "name": "汉语",
      },
      {
        "name": "中国少数民族语言",
      },
      {
        "name": "常用外国语",
      },
      {
        "name": "汉藏语系",
      },
      {
        "name": "阿尔泰语系(突厥-蒙古-通古斯语系）",
      },
      {
        "name": "南亚语系（澳斯特罗-亚细亚语系）",
      },
      {
        "name": "南印语系（达罗毗荼语系、德拉维达语系）",
      },
      {
        "name": "南岛语系（马来亚-玻里尼西亚语系）",
      },
      {
        "name": "东北亚诸语言",
      },
      {
        "name": "高加索语系（伊比利亚-高加索语系）",
      },
      {
        "name": "乌拉尔语系（芬兰-乌戈尔语系）",
      },
      {
        "name": "闪-含语系（阿非罗-亚细亚语系）",
      },
      {
        "name": "印欧语系",
      },
      {
        "name": "非洲诸语言",
      },
      {
        "name": "美洲诸语言",
      },
      {
        "name": "大洋州诸语言",
      },
      {
        "name": "国际辅助语（如世界语）",
      }
    ]
  },
  {
    "name": "文学",
    "sub" : [
      {
        "name": "文学理论",
      },
      {
        "name": "世界文学",
      },
      {
        "name": "中国文学",
      },
      {
        "name": "亚洲文学",
      },
      {
        "name": "非洲文学",
      },
      {
        "name": "欧洲文学",
      },
      {
        "name": "大洋洲文学",
      },
      {
        "name": "美洲文学",
      }
    ]
  },
  {
    "name": "艺术",
    "sub" : [
      {
        "name": "艺术理论",
      },
      {
        "name": "世界各国艺术概况",
      },
      {
        "name": "绘画",
      },
      {
        "name": "书法、篆刻",
      },
      {
        "name": "雕塑",
      },
      {
        "name": "摄影艺术",
      },
      {
        "name": "工艺美术",
      },
      {
        "name": "音乐",
      },
      {
        "name": "舞蹈",
      },
      {
        "name": "戏剧艺术",
      },
      {
        "name": "电影、电视艺术",
      }
    ]
  },
  {
    "name": "历史、地理",
    "sub": [
      {
        "name": "史学理论",
      },
      {
        "name": "世界史",
      },
      {
        "name": "中国史",
      },
      {
        "name": "亚洲史",
      },
      {
        "name": "非洲史",
      },
      {
        "name": "欧洲史",
      },
      {
        "name": "大洋洲史",
      },
      {
        "name": "美洲史",
      },
      {
        "name": "传记",
      },
      {
        "name": "文物考古",
      },
      {
        "name": "风俗习惯",
      },
      {
        "name": "地理",
      }
    ]
  },
  {
    "name": "自然科学总论",
    "sub": [
       {
        "name": "自然科学理论与方法论",
       },
       {
         "name": "自然科学现状及发展",
       },
       {
         "name": "自然科学机关、团体、会议",
       },
       {
         "name": "自然科学研究方法",
       },
       {
         "name": "自然科学教育及普及",
       },
       {
         "name": "自然科学丛书、文集、连续性出版物",
       },
       {
         "name": "自然科学参考工具书",
       },
       {
         "name": "自然科学调查、考察",
       },
       {
         "name": "自然研究、自然历史",
       },
       {
         "name": "非线性科学",
       },
       {
         "name": "系统科学",
       }
    ]
  }, {
    "name": " 数理科学和化学",
    "sub": [
      {
        "name": "数学",
      },
      {
        "name": "力学",
      },
      {
        "name": "物理学",
      },
      {
        "name": "化学",
      },
      {
        "name": "晶体学",
      }
    ]
  },
  {
    "name": "天文学、地球科学",
    "sub": [
      {
        "name": "天文学",
      },
      {
        "name": "测绘学",
      },
      {
        "name": "地球物理学",
      },
      {
        "name": "大气科学（气象学）",
      },
      {
        "name": "地质学",
      },
      {
        "name": "海洋学",
      },
      {
        "name": "自然地理学",
      }
    ]
  },
  {
    "name": "生物科学",
    "sub": [
      {
        "name": "普通生物学",
      },
      {
        "name": "细胞学",
      },
      {
        "name": "遗传学",
      },
      {
        "name": "生理学",
      },
      {
        "name": "生物化学",
      },
      {
        "name": "生物物理学",
      },
      {
        "name": "分子生物学",
      },
      {
        "name": "生物工程学（生物技术）",
      },
      {
        "name": "古生物学",
      },
      {
        "name": "微生物学",
      },
      {
        "name": "植物学",
      },
      {
        "name": "动物学",
      },
      {
        "name": "昆虫学",
      },
      {
        "name": "人类学",
      }
    ]
  },
  {
    "name": "医药、卫生",
    "sub": [
      {
        "name": "预防医学、卫生学",
      },
      {
        "name": "中国医学",
      },
      {
        "name": "基础医学",
      },
      {
        "name": "临床医学",
      },
      {
        "name": "内科学",
      },
      {
        "name": "外科学",
      },
      {
        "name": "妇产科学",
      },
      {
        "name": "儿科学",
      },
      {
        "name": "肿瘤学",
      },
      {
        "name": "神经病学与精神病学",
      },
      {
        "name": "皮肤病学与性病学",
      },
      {
        "name": "耳鼻喉科学",
      },
      {
        "name": "眼科学",
      },
      {
        "name": "口腔科学",
      },
      {
        "name": "外国民族医学",
      },
      {
        "name": "特种医学",
      },
      {
        "name": "药学",
      },
    ] 
  },
  {
    "name": "农业科学",
    "sub": [
      {
        "name": "农业基础科学",
      },
      {
        "name": "农业工程",
      },
      {
        "name": "农学（农艺学）",
      },
      {
        "name": "植物保护",
      },
      {
        "name": "农作物",
      },
      {
        "name": "园艺",
      },
      {
        "name": "林业",
      },
      {
        "name": "畜牧、兽医、狩猎、蚕、蜂",
      },
      {
        "name": "水产、渔业",
      }
    ]
  },
  {
    "name": "工业技术",
    "sub": [
      {
        "name": "一般工业技术",
      },
      {
        "name": "矿业工程",
      },
      {
        "name": "石油、天然气工程",
      },
      {
        "name": "冶金工业",
      },
      {
        "name": "金属学与金属工艺",
      },
      {
        "name": "机械、仪表工业",
      },
      {
        "name": "武器工业",
      },
      {
        "name": "能源与动力工程",
      },
      {
        "name": "原子能技术",
      },
      {
        "name": "电工技术",
      },
      {
        "name": "电子技术、通信技术",
      },
      {
        "name": "自动化技术、计算技术",
      },
      {
        "name": "化学工业",
      },
      {
        "name": "轻工业、手工业",
      },
      {
        "name": "建筑科学",
      },
      {
        "name": "水利工程",
      }
    ]
  },
  {
    "name": "交通运输",
    "sub": [
      {
        "name": "综合运输",
      },
      {
        "name": "铁路运输",
      },
      {
        "name": "公路运输",
      },
      {
        "name": "水路运输",
      }
    ]
  },
  {
    "name": "航空、航天",
    "sub": [
      {
        "name": "航空、航天技术的研究与探索",
      },
      {
        "name": "航空",
      },
      {
        "name": "航天（宇宙航行）",
      }
    ]
  },
  {
    "name": "环境科学、安全科学",
    "sub": [
      {
        "name": "环境科学基础理论",
      },
      {
        "name": "社会与环境",
      },
      {
        "name": "环境保护管理",
      },
      {
        "name": "灾害及其防治",
      },
      {
        "name": "环境污染及其防治",
      },
      {
        "name": "废物处理与综合利用",
      },
      {
        "name": "环境质量评价与环境监测",
      },
      {
        "name": "安全科学",
      }
    ]
  },
  {
    "name": "综合性图书",
    "sub": [
      {
        "name": "丛书",
      },
      {
        "name": "百科全书、类书",
      },
      {
        "name": "辞典",
      },
      {
        "name": "论文集、全集、选集、杂著",
      },
      {
        "name": "年鉴、年刊",
      },
      {
        "name": "期刊、连续性出版物",
      },
      {
        "name": "图书目录、文摘索引",
      }
    ]
  }
];
function init(that) {
  that.setData({
    'book': book
  });
}

module.exports = {
  init: init
}